# 如何交换x，y的值
x = 10
y = 20

# 错误写法
# x = y
# y = x
# print(f'{x = }, {y = }')

# 1.临时变量法
# temp = x
# x = y
# y = temp
# print(f'{x = }, {y = }')

# 2.+ - 运算法
# x = x + y   # x=30
# y = x - y   # y=10
# x = x - y   # x=20
# print(f'{x = }, {y = }')

# 3.python 特有的交换方法
# x,y = y,x
# print(f'{x = }, {y = }')

# 4.位运算法 —— 异或交换法 （口诀：不同为1，相同为0）
# print(f'{x = }, {y = }')
# '''
#     位位置	7	6	5	4	3	2	1	0
#     权值	    128	64	32	16	8	4	2	1
#     二进制	0	0	0	0	0	0	0	0
#
#     10     0000 1010
#     20     0001 0100
#     x=30   0001 1110
# '''
# x = x ^ y
# print(f'{x = }, {y = }')
# ''''
#     30     0001 1110
#     20     0001 0100
#     y=10   0000 1010
# '''
# y = x ^ y
# print(f'{x = }, {y = }')
#
# ''''
#     30     0001 1110
#     10     0000 1010
#     x=20   0001 0100
# '''
# x = x ^ y
# print(f'{x = }, {y = }')


# 其他运算符操作
# 左移运算符 <<  : 二进制表示的数向左移动n位，等价于乘以2的n次方
'''
 位位置	7	6	5	4	3	2	1	0
权值	    128	64	32	16	8	4	2	1
二进制	0	0	0	0	0	0	0	0
 10  0000 1010
 向左移动一位   0001 0100    20
'''
n = 10
n = n << 1
print(f'{n = }')
# 右移运算符 >>  : 二进制表示的数向右移动n位，等价于除以2的n次方
'''
    10  0000 1010
    向右移动一位   0000 0101   5
'''
m = 10
m = m >> 1
print(f'{m = }')
# 按位与运算符 &  : 二进制表示的数按位与操作，结果为1当且仅当两个数的对应位均为1, （全为1则是1）
''''
    t = 10   0000 1010
    j = 6    0000 0110
    k = 2     0000 0010
'''
t = 10
j = 6
k = t & j
print(f'{k = }')

# 按位或运算符 |  : 二进制表示的数按位或操作，结果为1当且仅当两个数的对应位至少有一个为1，（有一个为1则为1）
''''
a=9  0000 1001
b=6  0000 0110
z=15  0000 1111
'''
a=9
b=6
z = a | b
print(f'{z = }')